unit hlp;

interface

uses
  Windows, Messages, SysUtils, Classes, Graphics, Controls, Forms, Dialogs,
  StdCtrls//, ComCtrls
  ;

type
  Th = class(TForm)
    l: TListBox;
    Label1: TLabel;
    procedure lClick(Sender: TObject);
    procedure lKeyPress(Sender: TObject; var Key: Char);
  private
    { Private declarations }
  public
    { Public declarations }
  end;
 Procedure hs;
var
  h: Th;

implementation

uses re;

{$R *.DFM}
Procedure hs;
begin
 r.show;
 r.e.Clear;
 case h.l.itemindex of
 0:
  r.e.text:='Ціль гри та сама, що у славнозвісній грі "Хто скорше перейде":'+
    ' потрібно перевести свої фішки туди, де стояли фішки супротивника.';
 1:
  r.e.text:='Правила гри ті самі, що у славнозвісній грі "Хто скорше перейде":'+
    ' ходи роблять по черзі; за один хід можна пересунути одну фішку'+
  ' на сусідню вільну клітинку (сусідня клітинка - це така, що має спільну сторону з даною клітинкою,'+
  ' а вільна клітинка - це така, що на ній нема іншої фішки);'+
 ' також за один хід можна одною фішкою зробити одне чи декілька таких пересувань:'+
 ' фішкою можна перескочити через сусідню фішку (фішку, що знаходиться на сусідній клітинці) на вільну клітинку, що'+
 ' знаходиться одразу за сусідньою фішкою, через яку ця фішка перескакує.';
 3:
  r.e.text:='Як пересувати фішки - дуже просто: рухаючи мишкою вибираєте'+
 ' фішку, яку хочете пересунути; коли Ви вибрали, натисніть '+
 'клавішу миші і тримайте її; далі пересуньте мишку туди, де Ви хочете,'+
' щоб стояла фішка, яку Ви вибрали; і після цього відпустіть мишку.'+
' Якщо Ви зробили хід за правилами, то фішка пересунеться.'+
' Щоб перескочити фішкою через декілька фішок, робіть стільки пересувань,'+
' через скільки фішок Ви хочете перескочити, кожною разу користуючись схемою,'+
' поданою вище (тобто, щоб перескочити через дві фішки Вам треба принаймі'+
' двічі натиснути мишку і двічі відпустити). До речі, клацання лівою клавішою'+
' миші рівнозначне натисканню клавіші Enter, а клацання правою клавішою'+
' миші рівнозначне натисканню клавіші Space (пропуск). '+
'Вибирати фішку можна і клавіатурою клавішами вліво, вправо, вверх і вниз.'+
' При грі з компом можуть виникати глюки, довгі ходи заборонені.';
 4:
  r.e.text:='Щоб викликати довідку, потрібно натиснути клавішу F1 або вибрати'+
  ' підменю "Як бавитися? (Виклик довідки)" меню "Допомога", після чого '+
  'клацнути лівою кнопкою миші після того, як наведете курсор на заголовок'+
  ' теми, що Вас цікавить (або вибрати цей заголовок клавішами).';
 5:
  r.e.text:='Якщо Ви вважаєте, що походили неправильно, ваш хід можна відмінити'+
  '.'+
  ' Щоб це зробити (відмінити останній хід), потрібно вибрати підменю "Відміни'+
  'ти останній хід" меню "Опції".'+
  ' Взагалі, усі ходи від початку гри можна відмінити. '+
  'Щоб це зробити (відмінити усі ходи від початку гри), потрібно вибрати підменю "Відміни'+
  'ти всі ходи від початку гри" меню "Опції".'+
  ' Якщо після того, як Ви відмінили хід, Ви вирішили, що, все ж таки, походил'+
  'и тоді правильно, ваш хід повторити.'+
  ' Щоб це зробити (повторити останній скасований хід), потрібно ви'+
  'брати підменю "Повторити останній скасований хід" меню "Опції".'+
  ' Взагалі, усі ходи, що були скасовані і не повторені, можна повторити.'+
  ' Щоб це зробити (повторити всі скасовані ходи), потрібно ви'+
  'брати підменю "Повторити всі скасовані ходи" меню "Опції".';
 6:
  r.e.text:='Якщо Ви вважаєте, що граєте погано, щоб розпочати гру по-новому,'+
  ' Ви маєте два способи, але перевірте, чи справді хочете розпочати гру по-новому, чи хочете дещо з даної партії зберегти: 1. Якщо Ви вважаєте, що кілька перших ходів ви зробили'+
  ' правильно, можете відмінити усі ходи, а потім повторити декілька з них. '+
  '2. Якщо Ви вважаєте, що кілька останніх ходів ви зробили'+
  ' неправильно, можете відмінити ці ходи. '+
  '3. Якщо Ви справді хочете розпочати гру по-новому,'+
  ' Ви можете або відмінити всі ходи, або почати нову гру, тобто вибрати '+
  'підменю "Почати нову гру" меню "Ігрове меню".';
 7:
  r.e.text:='Вибрати спосіб гри можна у '+
  'підменю "Вибрати спосіб гри" меню "Опції".';
  //+
  //' Але в демонстраційній версії доступним є лише спосіб "Людина - людина".'
 2:
  r.e.text:='У зв''язку з можливістю махлювати, виконуючи правила гри,'+
   ' я пропоную додати ще деякі правила, які називаю "Додаткові правила гри",'+
   ' а саме: гравець повинен вивести свої фішки з тої території, де вони були '+
   ' на початку гри до того часу, як в іншого гравця з''явиться можливість'+
   ' виграти, тобто гравець повинен звільнити місце для фішок супротивника;'+
   ' якщо гравець допустив такої позиції, що супротивник не може зробити хід'+
  ' він програв.'+
  ' Дотримуватися цих правил чи ні - рішення гравців, бо таких правил ніде '+
 ' не зафіксовано, а отже, їх нема в цій програмі, але, звичайно, комп''ютер '+
 'спеціально не махлює.';
 else
  r.e.text:='Невідома тема!';
 end;
end;

procedure Th.lClick(Sender: TObject);
begin
 hs;
end;

procedure Th.lKeyPress(Sender: TObject; var Key: Char);
begin
hs;
end;

end.
